ARMmbed/mbed-os/targets/TARGET_TOSHIBA/TARGET_TMPM46B/Periph_Driver/src/tmpm46b_cg.c
    return stby_mode;
}

/**
  * @brief  Enable or disable to keep IO control signal in stop2 mode
  * @param  NewState: enable or disable
  *   This parameter can be one of the following values:
  *   ENABLE or DISABLE
  * @retval None
  */
void CG_SetPortKeepInStop2Mode(FunctionalState NewState)
{
    uint32_t regval = TSB_CG->STBYCR;
    /* Check the parameters */
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    if (NewState == ENABLE) {
        regval |= CG_STBYCR_PTKEEP_SET;
    } else {
        regval &= CG_STBYCR_PTKEEP_CLEAR;
    }
    TSB_CG->STBYCR = regval;
}

/**
  * @brief  Get the status of  IO control signal in stop2 mode
  * @param  None
  * @retval State of IO control signal in stop2 mode
  *   The value returned can be one of the following values:
  *   DISABLE or ENABLE
  */
FunctionalState CG_GetPortKeepInStop2Mode(void)
{
    uint32_t regval = TSB_CG->STBYCR;
    FunctionalState state = DISABLE;

    regval &= CG_STBYCR_PTKEEP_SET;
    if (regval == CG_STBYCR_PTKEEP_SET) {
        /* Pin status in stop mode is active */
        state = ENABLE;
    } else {
        /* Do nothing */
    }
    return state;
}

/**
  * @brief  Set the source of fc
  * @param  Source:  The source of fc
  *   This parameter can be one of the following values:
  *   CG_FC_SRC_FOSC or CG_FC_SRC_FPLL
  * @retval success or failure
  *   The value returned can be one of the following values:
  *   SUCCESS or ERROR
  */
Result CG_SetFcSrc(CG_FcSrc Source)
{
    Result retval = ERROR;
    FunctionalState fosc_on = DISABLE;
    FunctionalState pllon = DISABLE;
    CG_FoscSrc fosc_src = CG_FOSC_OSC_EXT;
    uint32_t regval = TSB_CG->PLLSEL;

    /* Check the parameters */
    assert_param(IS_CG_FC_SRC(Source));

    if (Source == CG_FC_SRC_FOSC) {
        fosc_src = CG_GetFoscSrc();
        switch (fosc_src) {
        case CG_FOSC_OSC_EXT:
            fosc_on = CG_GetFoscState(CG_FOSC_OSC_EXT);
            if (fosc_on == ENABLE) {
                regval &= CG_PLLSEL_PLLSEL_CLEAR;
                retval = SUCCESS;
            } else {
                /* Do nothing */
            }
            break;
        case CG_FOSC_OSC_INT:
            fosc_on = CG_GetFoscState(CG_FOSC_OSC_INT);
            if (fosc_on == ENABLE) {
                regval &= CG_PLLSEL_PLLSEL_CLEAR;
                retval = SUCCESS;
            } else {
                /* Do nothing */
            }
            break;
        case CG_FOSC_CLKIN_EXT:
            regval &= CG_PLLSEL_PLLSEL_CLEAR;
            retval = SUCCESS;
            break;
        default:
            /* Do nothing */
            break;
        }

    } else {
        pllon = CG_GetPLLState();
        if (pllon == ENABLE) {
            regval |= CG_PLLSEL_PLLSEL_SET;
            retval = SUCCESS;
        } else {
            /* Do nothing */
        }
    }
    TSB_CG->PLLSEL = regval;
    return retval;
}

/**
  * @brief  Get the source of fc
  * @param  None
  * @retval The source of fc
  *   The value returned can be one of the following values:
  *   CG_FC_SRC_FOSC or CG_FC_SRC_FPLL
  */
CG_FcSrc CG_GetFcSrc(void)
{
    uint32_t regval = TSB_CG->PLLSEL;
    CG_FcSrc fcsrc = CG_FC_SRC_FOSC;

    regval &= CG_PLLSEL_PLLST_SET;
    if (regval == CG_PLLSEL_PLLST_SET) {
        fcsrc = CG_FC_SRC_FPLL;
    } else {
        /* Do nothing */
    }

    return fcsrc;
}

/**
  * @brief  Enable or disable to protect CG registers
  * @param  NewState: New state of the CG protect register
  *   This parameter can be one of the following values:
  *   DISABLE or ENABLE
  * @retval None
  */
void CG_SetProtectCtrl(FunctionalState NewState)
{
    /* Check the parameters */
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    if (NewState == ENABLE) {
        TSB_CG->PROTECT = CG_PROTECT_SET;
    } else {
        TSB_CG->PROTECT = CG_PROTECT_CLEAR;
    }
}

/**
  * @brief  Setup the INT source for releasing low power mode.
  * @param  INTSource: Select the release INT source
  *   This parameter can be one of the following values:
  *   CG_INT_SRC_1, CG_INT_SRC_2, CG_INT_SRC_7, CG_INT_SRC_8,
  *   CG_INT_SRC_D, CG_INT_SRC_E, CG_INT_SRC_F or CG_INT_SRC_RTC.
  * @param  ActiveState: select the active state for release trigger
  *   For CG_INT_SRC_RTC, this parameter can only be
  *   CG_INT_ACTIVE_STATE_FALLING
  *   For the other interrupt source, this parameter can be one of 
  *   the following values:
  *   CG_INT_ACTIVE_STATE_L, CG_INT_ACTIVE_STATE_H,
  *   CG_INT_ACTIVE_STATE_FALLING, CG_INT_ACTIVE_STATE_RISING or
  *   CG_INT_ACTIVE_STATE_BOTH_EDGES.
  * @param  NewState: Enable or disable this release trigger
  *   This parameter can be one of the following values:
  *   DISABLE or ENABLE
  * @retval None
  */
void CG_SetSTBYReleaseINTSrc(CG_INTSrc INTSource,
                             CG_INTActiveState ActiveState, FunctionalState NewState)
{
    uint32_t num = 0U;
    uint8_t i = 0U;
    uint8_t j = 0U;
    CG_Byte4 regval = { 0U };

    /* Check the parameters */
    assert_param(IS_CG_INT_SRC(INTSource));
    assert_param(IS_CG_INT_ACTIVE_STATE(ActiveState));
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    if (INTSource == CG_INT_SRC_RTC) {
        assert_param(IS_CG_INT_RTC_ACTIVE_STATE(ActiveState));
    } else {
        /* Do nothing */
    }

    num = (uint32_t) INTSource;
    i = (uint8_t) (num / 4U);
    j = (uint8_t) (num % 4U);

    switch (i) {
    case 0U:                   /* IMCGA */
        regval.byte4 = TSB_CG->IMCGA;
        regval.byte[j] &= 0x8CU;
        regval.byte[j] |= ActiveState;
        TSB_CG->IMCGA = regval.byte4;
        regval.byte[j] |= NewState;
        TSB_CG->IMCGA = regval.byte4;
        break;
    case 1U:                   /* IMCGB */
        regval.byte4 = TSB_CG->IMCGB;
        regval.byte[j] &= 0x8CU;
        regval.byte[j] |= ActiveState;
        TSB_CG->IMCGB = regval.byte4;
        regval.byte[j] |= NewState;
        TSB_CG->IMCGB = regval.byte4;
        break;
    default:
        /* Do nothing */
        break;
    }
}

/**
  * @brief  Get the active state of INT source standby clear request
  * @param  INTSource: Select the release INT source
  *   This parameter can be one of the following values:
  *   CG_INT_SRC_1, CG_INT_SRC_2, CG_INT_SRC_7, CG_INT_SRC_8,
  *   CG_INT_SRC_D, CG_INT_SRC_E, CG_INT_SRC_F or CG_INT_SRC_RTC.
  * @retval Active state of the input INT
  *   The value returned can be one of the following values:
  *   CG_INT_ACTIVE_STATE_FALLING, CG_INT_ACTIVE_STATE_RISING,
  *   CG_INT_ACTIVE_STATE_BOTH_EDGES or CG_INT_ACTIVE_STATE_INVALID
  */
CG_INTActiveState CG_GetSTBYReleaseINTState(CG_INTSrc INTSource)
{
    CG_INTActiveState int_active_state = CG_INT_ACTIVE_STATE_INVALID;
    uint8_t i = 0U;
    uint8_t j = 0U;
    uint8_t tmp = 0U;
    uint32_t num = 0U;
    CG_Byte4 regval[6] = { {0U}
    , {0U}
    , {0U}
    , {0U}
    , {0U}
    , {0U}
    };

    /* Check the parameters */
    assert_param(IS_CG_INT_SRC(INTSource));

    regval[0].byte4 = TSB_CG->IMCGA;
    regval[1].byte4 = TSB_CG->IMCGB;

    num = (uint32_t) INTSource;
    i = (uint8_t) (num / 4U);
    j = (uint8_t) (num % 4U);
    tmp = regval[i].byte[j];
    tmp &= 0x0CU;

    switch (tmp) {
    case 0x04U:
        int_active_state = CG_INT_ACTIVE_STATE_RISING;
        break;
    case 0x08U:
        int_active_state = CG_INT_ACTIVE_STATE_FALLING;
        break;
    case 0x0CU:
        int_active_state = CG_INT_ACTIVE_STATE_BOTH_EDGES;
        break;
    default:
        /* Do nothing */
        break;
    }

    return (int_active_state);
}

/**
  * @brief  Clears the input INT request.
  * @param  INTSource: Select the release INT source
  *   This parameter can be one of the following values:
  *   CG_INT_SRC_1, CG_INT_SRC_2, CG_INT_SRC_7, CG_INT_SRC_8,
  *   CG_INT_SRC_D, CG_INT_SRC_E, CG_INT_SRC_F or CG_INT_SRC_RTC.
  * @retval None
  */
void CG_ClearINTReq(CG_INTSrc INTSource)
{
    uint32_t regval = INTSource;

    /* Check the parameters */
    assert_param(IS_CG_INT_SRC(INTSource));

    TSB_CG->ICRCG = regval;
}

/**
  * @brief  Get the NMI flag that shows who triggered NMI.
  * @param  None
  * @retval NMI flag
  */
CG_NMIFactor CG_GetNMIFlag(void)
{
    CG_NMIFactor cg_nmi_factor = { 0U };

    cg_nmi_factor.All = TSB_CG->NMIFLG & (~CG_NMIFLG_MASK);

    return cg_nmi_factor;
}

/**
  * @brief  Get the flag for stopping of the internal high-speed oscillator or writing to the flash memory.
  * @param  None
  * @retval Flag for stopping of the internal high-speed oscillator or writing to the flash memory.
  *   The value returned can be one of the following values:
  *   ENABLE or DISABLE
  */
FunctionalState CG_GetIOSCFlashFlag(void)
{
    uint32_t tmp = TSB_CG->RSTFLG;
    FunctionalState state = DISABLE;

    tmp &= CG_IOSC_FLASH_MASK;
    if (tmp == CG_IOSC_FLASH_MASK) {
        state = ENABLE;
    } else {
        /* Do nothing */
    }

    return state;
}

/**
  * @brief  Get the type of reset reason and clear the reset flag.
  * @param  None
  * @retval Reset flag
  */
CG_ResetFlag CG_GetResetFlag(void)
{
    CG_ResetFlag reset_flag = { 0U };

    reset_flag.All = TSB_CG->RSTFLG & (~CG_RESET_FLAG_MASK);
    TSB_CG->RSTFLG = CG_IOSC_FLASH_MASK;

    return reset_flag;
}

/**
  * @brief  Enable or disable supplying clock fsys for ADC.
  * @param  NewState: New state of clock fsys supply setting for ADC.
  *   This parameter can be one of the following values:
  *   ENABLE or DISABLE.
  * @retval None.
  */
void CG_SetADCClkSupply(FunctionalState NewState)
{
    volatile uint32_t tmp = 0U;

    /* Check the parameters */
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    /* Check ADC is not during conversion */
    do {
        tmp = TSB_AD->MOD5 & ADC_MOD5_BUSY_MASK;
    }
    while (tmp);

    /* Set CGSYSCR<FCSTOP>  */
    tmp = TSB_CG->SYSCR;
    if (NewState == ENABLE) {
        tmp &= CG_SYSCR_FCSTOP_CLEAR;
    } else {
        tmp |= CG_SYSCR_FCSTOP_SET;
    }
    TSB_CG->SYSCR = tmp;
}

 /**
   * @brief  Enable or disable supplying clock fsys to peripheries
   * @param  Periph: The target peripheral of CG supplies clock
   *   This parameter can be one of the following values or their combination:
   *   CG_FC_PERIPH_PORTA,  CG_FC_PERIPH_PORTB,  CG_FC_PERIPH_PORTC,
   *   CG_FC_PERIPH_PORTD,  CG_FC_PERIPH_PORTE,  CG_FC_PERIPH_PORTF,
   *   CG_FC_PERIPH_PORTG,  CG_FC_PERIPH_PORTH,  CG_FC_PERIPH_PORTJ,
   *   CG_FC_PERIPH_PORTK,  CG_FC_PERIPH_PORTL,  CG_FC_PERIPH_TMRB0,
   *   CG_FC_PERIPH_TMRB1,  CG_FC_PERIPH_TMRB2,  CG_FC_PERIPH_TMRB3,
   *   CG_FC_PERIPH_TMRB4,  CG_FC_PERIPH_TMRB5,  CG_FC_PERIPH_TMRB6,
   *   CG_FC_PERIPH_TMRB7,  CG_FC_PERIPH_MPT0,   CG_FC_PERIPH_MPT1,
   *   CG_FC_PERIPH_MPT2,   CG_FC_PERIPH_MPT3,   CG_FC_PERIPH_TRACE,
   *   CG_FC_PERIPHA_ALL.
   * @param  NewState: New state of clock supply setting.
   *   This parameter can be one of the following values:
   *   DISABLE or ENABLE
   * @retval None
   */
void CG_SetFcPeriphA(uint32_t Periph, FunctionalState NewState)
{
    assert_param(IS_FUNCTIONAL_STATE(NewState));
    assert_param(IS_CG_FC_PERIPHA(Periph));
    if (NewState == ENABLE) {   /* clear to '0' to enable */
        TSB_CG->FSYSMSKA &= ~Periph;
    } else {                    /* write '1' to disable   */
        TSB_CG->FSYSMSKA |= Periph;
    }
}

 /**
   * @brief  Enable or disable supplying clock fsys to peripheries
   * @param  Periph: The target peripheral of CG supplies clock
   *   This parameter can be one of the following values or their combination:
   *   CG_FC_PERIPH_SIO_UART0, CG_FC_PERIPH_SIO_UART1, CG_FC_PERIPH_SIO_UART2,
   *   CG_FC_PERIPH_SIO_UART3, CG_FC_PERIPH_UART0, CG_FC_PERIPH_UART1,
   *   CG_FC_PERIPH_I2C0,      CG_FC_PERIPH_I2C1,  CG_FC_PERIPH_I2C2,
   *   CG_FC_PERIPH_SSP0,      CG_FC_PERIPH_SSP1,  CG_FC_PERIPH_SSP2,
   *   CG_FC_PERIPH_EBIF,      CG_FC_PERIPH_DMACA, CG_FC_PERIPH_DMACB,
   *   CG_FC_PERIPH_DMACC,     CG_FC_PERIPH_DMAIF, CG_FC_PERIPH_ADC,
   *   CG_FC_PERIPH_WDT,       CG_FC_PERIPH_MLA,   CG_FC_PERIPH_ESG,
   *   CG_FC_PERIPH_SHA,       CG_FC_PERIPH_AES,   CG_FC_PERIPHB_ALL.
   * @param  NewState: New state of clock supply setting.
   *   This parameter can be one of the following values:
   *   DISABLE or ENABLE
   * @retval None
   */
void CG_SetFcPeriphB(uint32_t Periph, FunctionalState NewState)
{
    assert_param(IS_FUNCTIONAL_STATE(NewState));
    assert_param(IS_CG_FC_PERIPHB(Periph));
    if (NewState == ENABLE) {   /* clear to '0' to enable */
        TSB_CG->FSYSMSKB &= ~Periph;
    } else {                    /* write '1' to disable   */
        TSB_CG->FSYSMSKB |= Periph;
    }
}

/**
  * @brief  Enable or disable low-speed oscillator (fs) for RTC
  * @param  NewState: oscillator is enabled or disabled
  *   This parameter can be one of the following values:
  *   DISABLE or ENABLE
  * @retval None
  */
void CG_SetFs(FunctionalState NewState)
{
    /* Check the parameters */
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    if (NewState == ENABLE) {
        /* Enable low-speed oscillator */
        TSB_CG->OSCCR |= CG_OSCCR_XTEN_SET;
        TSB_CG->OSCCR |= CG_OSCCR_DRVOSCL_SET;
    } else {
        /* Disable low-speed oscillator */
        TSB_CG->OSCCR &= CG_OSCCR_XTEN_CLEAR;
        TSB_CG->OSCCR &= CG_OSCCR_DRVOSCL_CLEAR;
    }
}

/** @} */
/* End of group CG_Exported_Functions */

/** @} */
/* End of group CG */

/** @} */
/* End of group TX04_Periph_Driver */

#endif                          /* defined(__TMPM46B_CG_H) */
